In [ ]:
======================EDA==========================
1) Pandas : Data frame applications

2) Numpy  : Numerical python All math applications
    
3) Matplotlib : used for plotting
    
4) seaborn : used for plot
    
5) plotly  : used for plot
    
6) Bokhe   : plot
    
================== Machine learning ===================
7) Sickit-learn : sklearn
    
=================== Deep Learning ==============================
8) Tensorflow  : Google
    
9) Keras       : Google
    
10) Pytorch    : Facebook
    
====================== NLP =============================
11) NLTK : Natural langague tool kit
    
12) Scipy

======================== BERT ==========================
13) Transformeers : Hugging face (Google)
    
===================== Google models ======================
14) specific google packages

===================== Azure ML ======================
15) Azure packages

===================== GenAI ============================
16) Gemini : Google
    
17) chatGPT : OpenAI
    
=====================LangChain =====================
18) LangChain packages

In [ ]:
- list ==== dictionary

- dictionary ==== list

$ step-1$

**Create a dataframe**

In [7]:
import pandas as pd
names=['Ayush','Avinash','Akash']

In [8]:
pd.DataFrame() # empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

$step-2$

**provide the data**

In [9]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [10]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# what is the first positional arguments: data
# second positional argument: index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [11]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  25      hyd
1  Avinash  30      blr
2    Akash  35  chennai

In [12]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

$step-3$

**Provide the column names**

In [13]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
            columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [14]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','city']
df=pd.DataFrame(data,columns=cols)

In [15]:
type(df)

pandas.core.frame.DataFrame

$step-4$

**ADD new column**

- if you want to add new column

- First you need to check the number of rows in already existed data

- For example in above the dataframe has 3 rows

- you need to create a new list with 3 rows

- that list equate to the dataframe

In [16]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     city JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

In [17]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','city']
df=pd.DataFrame(data,columns=cols)
df

     Names  Age     city
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [18]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     city JOB
0    Ayush   25      hyd  DS
1  Avinash   30      blr  DE
2    Akash   35  chennai  CS

$step-5$

**update the already Existed column**

  - Create new column and update new column both are same way

In [19]:
df['Age']=[35,40,45]
df

     Names  Age     city JOB
0    Ayush   35      hyd  DS
1  Avinash   40      blr  DE
2    Akash   45  chennai  CS

$step-6$

**change the index**

In [20]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

**Note**

   - Number of list equal to **Number of columns**
   
    
   - Number of values inside list equals to **Number of rows**
   

   - When you can create the data all the lists will be in same length

In [21]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

ValueError: Length of values (3) does not match length of index (4)

$step-7$

   - Number of rows
    
   - Number of columns

In [ ]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

$step-8$

**Drop the column**

  - In order to drop column we required 3 arguments
    
  - column name

      - The column name we need to mention
    
  - axis

      - axis=0 **represents rows
    
      - axis-1 **represents columns
        
  - inplace  

      - we are drop column means we are modifying the data frame
    
      - so this modification we want to save in same variable or different variable
        
      - if you want to keep in the same variable the inplace=True

In [ ]:
df

In [ ]:
df.drop('city',
       axis=1,
       inplace=True)

In [ ]:
df

In [22]:
df1=df.drop('Age',axis=1) # do not give inplace=True

In [23]:
df  # has two columns

     Names  Age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [24]:
df1

     Names     city
A    Ayush      hyd
B  Avinash      blr
C    Akash  chennai
D     Anvi   Mumbai

In [25]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','city']
idx=['A','B','C','D']
df=pd.DataFrame(data,
               index=idx,
               columns=cols)
df

     Names  Age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [26]:
df.drop('city',axis=1,inplace=True)

In [27]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [28]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [29]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

$step-9$

**Multiple columns drop**

In [30]:
# again read the data
import pandas as pd

names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','mumbai']

data=zip(names,age,city)
cols=['Names','Age','city']
idx=['A','B','C','D']

df=pd.DataFrame(data,
               index=idx,
               columns=cols)
df

     Names  Age     city
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [31]:
df.drop('A',axis=0,inplace=True)

In [32]:
df

     Names  Age     city
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

$step-11$

**How to save the data frame**

  - Generally data frames are two types
    
  - csv (comma seperated value)

  - excel

In [33]:
df

     Names  Age     city
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   mumbai

In [34]:
# file name=data
# extension=.csv
df.to_csv('data,csv')
df.to_csv('data1.csv',index=False)

In [35]:
# Extension
# .xlsx
df.to_excel("data2.xlsx",index=False)

In [36]:
name=['Aayush','Avinash','Akash','Avani']
age=[20,25,30,35]
city=['Ahmedabad','pune','Hyd','mumbai']
country=['India','india','India','India']
data=zip(names,age,city,country)
cols=['Names','Age','City','Country']
idx=['A','B','C','D']
df_harshini=pd.DataFrame(data,index=idx,columns=cols)
df_harshini

     Names  Age       City Country
A    Ayush   20  Ahmedabad   India
B  Avinash   25       pune   india
C    Akash   30        Hyd   India
D     Anvi   35     mumbai   India

In [37]:
df_harshini.drop('A',axis=0,inplace=True)

In [38]:
df_harshini

     Names  Age    City Country
B  Avinash   25    pune   india
C    Akash   30     Hyd   India
D     Anvi   35  mumbai   India